Έκδοση v0.2 Πρόσθεση κινδύνων,πιθανότητας να συμβούνε, μικροδιορθώσεις

e-Freelance

Μέλη της ομάδας:

Κανδύλης Βασίλης 5774

Κουρής Μιχάλης 5324

Σακελλαράκης Μιχάλης 5412

Μέλη που ασχολήθηκαν με αυτό το τεχνικό κείμενο:

Σακελλαράκης Μιχάλης (peer reviewer)

Κανδύλης Βασίλης (peer reviewer)

Κουρής Μιχάλης (editor)

• Διείσδυση στο market: Xωρίς ενα critical mass επαγγελματιών και πελατών η χρησιμότητα του site θα ειναι περιορισμένη. Αυτός είναι ένα πολύ πιθανός κίνδυνος και αποτελεί το μεγαλύτερο κίνδυνο για την βιωσιμότητα του project.
 Αυτο μπορει να αντιμετωπιστεί με διαφημίσεις σε μέσα κοινωνικής δικτύωσης αλλά και καλύτερη κοστολόγηση για τους πρώτους Χ επαγγελματίες.

• Curation ειδικών: Υπάρχει το ρίσκο να εγγραφούν επαγγελματίες οι οποίοι δεν είναι licensed και αυτο δυνάται να προκαλέσει θέματα liability αν κάνουν ζημία η κάτι αντίστοιχο. Μέτρια πιθανότητα να αποτελέσει πρόβλημα καθώς
μπορούμε να επικοινωνήσουμε με άλλους (μη συνδεδεμένους με το site) επαγγελματίες του κάθε κλάδου για να λάβουμε αμερόληπτη άποψη για το τι αποτελεί επαρκής πιστοποίηση.
Γι'αυτο θα απαιτούμε σχετικα πτυχία η επαγγελματικές άδειες (αντιστοιχα με το επάγγελμα) πρίν γίνει κάποιος επαγγελματιάς διαθέσιμος για τους πελάτες

• Θέματα με τις πληρωμές: ο τρόπος monetization του site ειναι μέσω commission απο κάθε πληρωμή που λαμβάνουν οι επαγγελματίες ως αντάλλαγμα για την ορατότητα που τους προσφέρει το site. Ο πραγματικός κίνδυνος εδώ
είναι ότι σε κάθε συναλλαγή για εμπορικούς λογαριασμούς οι τράπεζες παίρνουμε προμήθεια άρα τα profit margins πρέπει προσχετικά να να υπολογιστούνε για να είναι οικονομικά βιώσιμα αλλά ταυτόχρονα ανταγωνιστικά.
 Για να αποφεύγουμε απάτες κλπ θα κάνουμε ένα σύστημα escrow κατα το οποίο οι πληρωμές θα παιρνάνε απο του λογαριασμούς μας και θα παίρνουμε ετσι το μερίδιο μας.

• Εξασφάλιση υπηρεσιών και καλής σχέσης επαγγελματία-πελάτη: Για να αποφύγουμε προβλήματα κακοήθειας ΚΑΙ οι πελάτες και οι επαγγελματίες θα έχουν ορατό rating και σχόλια στην σελίδα τους με πιθανά παράπονα. Μικρή πιθανότητα
να αποτελέσει πρόβλημα, τέτοια self-regulating συστήματα αξιολόγησης έχουν αποδειχθεί να δουλεύουν στο industry (uber, airbnb etc)
 Ατασθαλείες οικονομικές (μη πληρωμής, απάτης, chargeback κτλ) θα παγώνουν τον λογαριασμό και θα γίνονται review απο ανθρώπινο δυναμικό
 
• Εξασφάλιση ασφάλειας των χρηματικών συναλλαγών. Υπάρχουνε standards (απο άποψη security) και άδειες που χρειάζονται για να δέχεται κανείς πληρωμές σε δικτυακό τόπο. Υπάρχουνε ειδικοί τύποι λογαριασμών που απαιτούνται για να
δεχόμαστε πληρωμές απο πιστωτικές (η debit) κάρτες, λέγονται Merchant accounts. Για να ελαχιστοποιήσουμε τον κίνδυνο ίσως χρειαστεί να προσλάβουμε κάποιον εξωτερικό συνεργάτη με εμπειρία στον τομέα αυτό. Σημάντικη πιθανότητα
να μας προκαλέσει προβλήματα λόγω του κόστους πρόσληψης άλλα και της αυξημένης πολυπλοκότητας implementation ασφαλών βάσεων δεδομένων, end-to-end encryption κτλ.


 
 
 
 
